/**
 * 非会員の購入フロー
 */
var Nightmare = require('nightmare');
var co = require('co');
var colors = require('colors/safe');

// ホスト
host = 'http://localhost:5080/';
// Basic認証
isUsedBasicAuth = false;
user = 'so-and-so';
password = 'foo';


// 在庫ありの商品ID
var productIds = [
1,2,3
];
// メールアドレス
var mailPrefix = 'yamada';
var mailDomain = '@example.com';

// テスト件数
var testTimes = 10000;

// データの設定
var userNames = [];
var addresses = [];
var prefCodes = [];
initData();

Nightmare
  .action(
    'clearCache',
    (name, options, parent, win, renderer, done) => {
      parent.respondTo('clearCache', done => {
        win.webContents.session.clearCache(done)
      })
      done()
    },
    function(done) {
      this.child.call('clearCache', done)
    }
  )

var nightmare = new Nightmare({
   show: true,
   height: 900,
   width: 1000,
   waitTimeout: 8000,
   // オレオレ証明書をスルーさせる
   switches: {
     'ignore-certificate-errors': true
   }
 });
nightmare
  .useragent("Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36");

if (isUsedBasicAuth) {
  nightmare
    .authentication(user, password)
}

/**
 * コンボボックスがある場合に、ランダムに選択します
 */
var selectCombo = function* (nightmare, selector) {
  let select = '';
  yield nightmare
    .evaluate(selector => {
      let vals = [];
      let options = document.querySelector(selector);
      if (options) {
        vals = Array.from(options).map(option => option.value);
      }
      return vals;
    }, selector)
    .then((vals) => {
      if (vals) {
        select = vals[getRandomNumber(1, vals.length - 1)];
      }
    });
  if (select) {
    yield nightmare
    .select(selector, select)
    .wait(1000);
  }
}

/**
 * メインの処理をするジェネレータ
 */
var generator = function* () {
  console.log(colors.inverse('start'));

  let isRepeatCartIn = false;
  for(var i = 1; i <= testTimes; i++) {
    process.stdout.write(i + '回目' + colors.green('　処理中') + '\r');
    
    try {
      // 1から10のランダムな数(以降の選択に使用)
      let vote = getRandomNumber(1, 10);
      
      // 非会員の選択
      let userId = getRandomNumber(0, userNames.length - 1);
      let user = userNames[userId];
      let mail = mailPrefix + getMailSuffix() + mailDomain;
      
      // 住所の選択
      let addressId = getRandomNumber(0, addresses.length - 1);
      let address = addresses[addressId];
      
      // 商品の選択
      let selectId = getRandomNumber(0, productIds.length - 1);
      let productId = productIds[selectId];

      // 商品詳細画面を表示
      yield nightmare
        .goto(host + 'products/detail/' + productId)
        .wait('.ec-headingTitle');
      
      // 規格の選択
      yield selectCombo(nightmare, '#classcategory_id1');
      yield selectCombo(nightmare, '#classcategory_id2');
            
      // 売り切れでない場合
      if (nightmare.exists('.add-cart') && 
          nightmare.exists('#quantity') && nightmare.visible('#quantity')) {
        // 数量の選択(1～10個)
        let select = getRandomNumber(1, 10);
        yield nightmare
          .insert('#quantity')
          .type('#quantity', select)
          .click('.add-cart')
          .wait(1000)
      }
      
      // 他の商品も選択するか決定(4割の割合で)
      if (vote <= 4) {
        isRepeatCartIn = true;
        process.stdout.write(i + '回目' + colors.green('　追加中') + '\r');
        continue;
      } else {
        isRepeatCartIn = false;
      }
      
      // カート画面
      yield nightmare
        .goto(host + 'cart')
        .wait(1000)
        .wait('.ec-blockBtn--action')
        .click('.ec-cartRole__actions .ec-blockBtn--action'); // レジに進む
      yield nightmare
        .wait('.ec-blockBtn--cancel')
        .click('.ec-guest__actions .ec-blockBtn--cancel') // ゲスト購入
        .wait(1000);
      // ゲスト購入画面
      yield nightmare
        .wait('.ec-blockBtn--action')
        .type('#nonmember_name_name01', user[1])
        .type('#nonmember_name_name02', user[2])
        .type('#nonmember_kana_kana01', user[5] != '' ? user[5] : 'ガイコク')
        .type('#nonmember_kana_kana02', user[6] != '' ? user[6] : 'ガイコク')
        .type('#nonmember_postal_code', address[0] + address[1])
        .select('#nonmember_address_pref', prefCodes[address[2]])
        .type('#nonmember_address_addr01', address[3])
        .type('#nonmember_address_addr02', address[4]+address[5])
        .type('#nonmember_phone_number', address[6].split('-')[0] + address[6].split('-')[1] + address[6].split('-')[2])
        .type('#nonmember_email_first', mail)
        .type('#nonmember_email_second', mail)
        .click('.ec-RegisterRole__actions .ec-blockBtn--action')
        .wait(1000);

      // 決済方法の選択
      let paymentIds = [];
      for (let paymentId = 1; paymentId <= 10; paymentId++) {
        yield nightmare
          .exists('#shopping_order_Payment_' + paymentId)
          .then(function(exists) {
            if (exists) paymentIds.push(paymentId);
          })
      }
      select = getRandomNumber(1, paymentIds.length);
      yield nightmare
        .click('#shopping_order_Payment_' + select)
        .wait(5000) // 決済方法を切り替えたときに時間をおく
      
      yield nightmare
        .click('.ec-totalBox__btn .ec-blockBtn--action') // 確認ボタン
        .wait(1000)
        .click('.ec-totalBox__btn .ec-blockBtn--action') // 注文ボタン
        .wait(1000);
        
      // 完了画面
      //yield nightmare
      //  .wait('.ec-reportDescription');
      process.stdout.write(i + '回目'  + colors.red('　注文!!') + '\r');
      yield nightmare
        .wait(1000);
    } catch (e) {
      console.log(i + '回目でエラーが発生しました');
      console.log(e);
      isRepeatCartIn = false;
    }
  
    if (isRepeatCartIn == false) {
      yield nightmare
        .cookies.clearAll()
    }
  }
  
  yield nightmare.end();
  console.log(colors.inverse('end'));
};

// ジェネレータの実行
co(generator).catch(console.error);

/**
 * 指定した数字をランダムに取得します
 */
function getRandomNumber(min, max) {
  return Math.floor(Math.random() * (max + 1 - min)) + min;
}

/**
 * メールアドレスをランダムに取得します
 */
function getMailSuffix() {
  let date = new Date();
  
  return '+' + date.getMonth() + date.getDate() + date.getMilliseconds();
}


/**
 * 本テストで使用するデータを設定します
 */
function initData() {
  userNames.push(["ja","髙﨑","棗","たかさき","なつめ","タカサキ","ナツメ"]);
  userNames.push(["ja","草彅","剛","くさなぎ","つよし","クサナギ","ツヨシ"]);
  userNames.push(["ja","𠮷田","景子","よしだ","けいこ","ヨシダ","ケイコ"]);
  userNames.push(["ja","髙﨑","棗","たかさき","なつめ","タカサキ","ナツメ"]);
  userNames.push(["ja","草彅","剛","くさなぎ","つよし","クサナギ","ツヨシ"]);
  userNames.push(["ja","𠮷田","景子","よしだ","けいこ","ヨシダ","ケイコ"]);
  userNames.push(["ja","髙﨑","棗","たかさき","なつめ","タカサキ","ナツメ"]);
  userNames.push(["ja","草彅","剛","くさなぎ","つよし","クサナギ","ツヨシ"]);
  userNames.push(["ja","𠮷田","景子","よしだ","けいこ","ヨシダ","ケイコ"]);
  userNames.push(["ja","髙﨑","棗","たかさき","なつめ","タカサキ","ナツメ"]);
  userNames.push(["ja","草彅","剛","くさなぎ","つよし","クサナギ","ツヨシ"]);
  userNames.push(["ja","𠮷田","景子","よしだ","けいこ","ヨシダ","ケイコ"]);
  userNames.push(["ja","髙﨑","棗","たかさき","なつめ","タカサキ","ナツメ"]);
  userNames.push(["ja","草彅","剛","くさなぎ","つよし","クサナギ","ツヨシ"]);
  userNames.push(["ja","𠮷田","景子","よしだ","けいこ","ヨシダ","ケイコ"]);
  userNames.push(["ja","植松","俊幸","うえまつ","としゆき","ウエマツ","トシユキ"]);
  userNames.push(["ja","梅本","誠二","うめもと","せいじ","ウメモト","セイジ"]);
  userNames.push(["ja","矢崎","智浩","やざき","ともひろ","ヤザキ","トモヒロ"]);
  userNames.push(["ja","藤倉","崇裕","ふじくら","たかひろ","フジクラ","タカヒロ"]);
  userNames.push(["ja","野末","裕次郎","のずえ","ゆうじろう","ノズエ","ユウジロウ"]);
  userNames.push(["ja","海老根","圭太郎","えびね","けいたろう","エビネ","ケイタロウ"]);
  userNames.push(["ja","三須","照夫","みす","てるお","ミス","テルオ"]);
  userNames.push(["ja","山腰","隆義","やまこし","たかよし","ヤマコシ","タカヨシ"]);
  userNames.push(["ja","奥泉","英貴","おくいずみ","ひでき","オクイズミ","ヒデキ"]);
  userNames.push(["ja","芳澤","良博","よしざわ","よしひろ","ヨシザワ","ヨシヒロ"]);
  userNames.push(["ja","野下","惠一","のした","けいいち","ノシタ","ケイイチ"]);
  userNames.push(["ja","加嶋","由和","かしま","よしかず","カシマ","ヨシカズ"]);
  userNames.push(["ja","大日向","守男","おおひなた","もりお","オオヒナタ","モリオ"]);
  userNames.push(["ja","浅谷","貴男","あさたに","たかお","アサタニ","タカオ"]);
  userNames.push(["ja","冨江","哲次","とみえ","てつじ","トミエ","テツジ"]);
  userNames.push(["ja","相樂","眞澄","さがら","ますみ","サガラ","マスミ"]);
  userNames.push(["ja","内池","亨","うちいけ","あきら","ウチイケ","アキラ"]);
  userNames.push(["ja","花田","茂伸","はなた","しげのぶ","ハナタ","シゲノブ"]);
  userNames.push(["ja","竹江","智己","たけえ","ともみ","タケエ","トモミ"]);
  userNames.push(["ja","定","政典","さだ","まさのり","サダ","マサノリ"]);
  userNames.push(["ja","道山","容平","みちやま","ようへい","ミチヤマ","ヨウヘイ"]);
  userNames.push(["ja","安木","正次","やすぎ","しょうじ","ヤスギ","ショウジ"]);
  userNames.push(["ja","小石原","晋之介","こいしはら","しんのすけ","コイシハラ","シンノスケ"]);
  userNames.push(["ja","藏","美雄","くら","よしお","クラ","ヨシオ"]);
  userNames.push(["ja","能登原","剛之","のとはら","たかゆき","ノトハラ","タカユキ"]);
  userNames.push(["ja","金宮","孝太朗","かねみや","こうたろう","カネミヤ","コウタロウ"]);
  userNames.push(["ja","門下","勇弥","かどした","ゆうや","カドシタ","ユウヤ"]);
  userNames.push(["ja","梶栗","義","かじくり","よし","カジクリ","ヨシ"]);
  userNames.push(["ja","福代","武臣","ふくしろ","たけおみ","フクシロ","タケオミ"]);
  userNames.push(["ja","波島","哲弘","なみしま","あきひろ","ナミシマ","アキヒロ"]);
  userNames.push(["ja","岸信","隆廣","きしのぶ","たかひろ","キシノブ","タカヒロ"]);
  userNames.push(["ja","羽森","雄磨","はもり","ゆうま","ハモリ","ユウマ"]);
  userNames.push(["ja","卯木","真臣","うき","まさおみ","ウキ","マサオミ"]);
  userNames.push(["ja","押渕","治幸","おしぶち","はるゆき","オシブチ","ハルユキ"]);
  userNames.push(["ja","戸次","保成","べつぎ","やすなり","ベツギ","ヤスナリ"]);
  userNames.push(["ja","門園","典央","かどその","のりお","カドソノ","ノリオ"]);
  userNames.push(["ja","比","敏司","ひ","さとし","ヒ","サトシ"]);
  userNames.push(["ja","相村","宗広","あいむら","むねひろ","アイムラ","ムネヒロ"]);
  userNames.push(["ja","塚平","公大","つかだいら","きみひろ","ツカダイラ","キミヒロ"]);
  userNames.push(["ja","矢中","紀康","やなか","のりやす","ヤナカ","ノリヤス"]);
  userNames.push(["ja","船越谷","惣太","ふなこしや","そうた","フナコシヤ","ソウタ"]);
  userNames.push(["ja","茶木","光朗","ちゃぎ","みつあき","チャギ","ミツアキ"]);
  userNames.push(["ja","浮世","大城","うきよ","だいき","ウキヨ","ダイキ"]);
  userNames.push(["ja","加知","徹郎","かち","てつお","カチ","テツオ"]);
  userNames.push(["ja","碇谷","由弘","いかりや","よしひろ","イカリヤ","ヨシヒロ"]);
  userNames.push(["ja","雲田","幸典","くもた","こうすけ","クモタ","コウスケ"]);
  userNames.push(["ja","月詠","義友","つくよみ","よしとも","ツクヨミ","ヨシトモ"]);
  userNames.push(["ja","華園","景司","はなぞの","けいじ","ハナゾノ","ケイジ"]);
  userNames.push(["ja","魚森","直司","うおもり","なおし","ウオモリ","ナオシ"]);
  userNames.push(["ja","恒崎","秀城","つねざき","ひでき","ツネザキ","ヒデキ"]);
  userNames.push(["ja","中野田","洋嗣","なかのだ","ひろつぐ","ナカノダ","ヒロツグ"]);
  userNames.push(["ja","点","尚浩","てん","たかひろ","テン","タカヒロ"]);
  userNames.push(["ja","大和谷","彰教","やまとだに","あきのり","ヤマトダニ","アキノリ"]);
  userNames.push(["ja","蛭名","吉永","えびな","よしなが","エビナ","ヨシナガ"]);
  userNames.push(["ja","舛木","恭嗣","ますき","やすし","マスキ","ヤスシ"]);
  userNames.push(["ja","保志門","美佐夫","ほしかど","みさお","ホシカド","ミサオ"]);
  userNames.push(["ja","志堂寺","康陽","しどうじ","やすはる","シドウジ","ヤスハル"]);
  userNames.push(["ja","海平","龍輔","うみひら","りゅうすけ","ウミヒラ","リュウスケ"]);
  userNames.push(["ja","波根","紘貴","はね","ひろき","ハネ","ヒロキ"]);
  userNames.push(["ja","岡本","敦子","おかもと","あつこ","オカモト","アツコ"]);
  userNames.push(["ja","中島","亜由美","なかしま","あゆみ","ナカシマ","アユミ"]);
  userNames.push(["ja","高","千夏","こう","ちなつ","コウ","チナツ"]);
  userNames.push(["ja","小山内","真樹","おさない","まき","オサナイ","マキ"]);
  userNames.push(["ja","権藤","エリカ","ごんどう","えりか","ゴンドウ","エリカ"]);
  userNames.push(["ja","赤石","あずみ","あかいし","あずみ","アカイシ","アズミ"]);
  userNames.push(["ja","澤木","花梨","さわき","かりん","サワキ","カリン"]);
  userNames.push(["ja","藤嶋","真沙美","ふじしま","まさみ","フジシマ","マサミ"]);
  userNames.push(["ja","戸松","和音","とまつ","かずね","トマツ","カズネ"]);
  userNames.push(["ja","江守","紗里","えもり","さり","エモリ","サリ"]);
  userNames.push(["ja","湯原","悠美子","ゆはら","ゆみこ","ユハラ","ユミコ"]);
  userNames.push(["ja","關","優華","せき","ゆか","セキ","ユカ"]);
  userNames.push(["ja","磯辺","笑子","いそべ","しょうこ","イソベ","ショウコ"]);
  userNames.push(["ja","小町","瑞江","こまち","みずえ","コマチ","ミズエ"]);
  userNames.push(["ja","水内","真咲","みずうち","まさき","ミズウチ","マサキ"]);
  userNames.push(["ja","生出","友里菜","おいで","ゆりな","オイデ","ユリナ"]);
  userNames.push(["ja","角山","麻","かくやま","あさ","カクヤマ","アサ"]);
  userNames.push(["ja","長野","梨枝","ちょうの","りえ","チョウノ","リエ"]);
  userNames.push(["ja","阿久沢","五十鈴","あくざわ","いすず","アクザワ","イスズ"]);
  userNames.push(["ja","水江","海里","みずえ","かいり","ミズエ","カイリ"]);
  userNames.push(["ja","千秋","直未","ちあき","なおみ","チアキ","ナオミ"]);
  userNames.push(["ja","原武","衣梨","はらたけ","えり","ハラタケ","エリ"]);
  userNames.push(["ja","菅生","絵利奈","すがお","えりな","スガオ","エリナ"]);
  userNames.push(["ja","安友","佳永","やすとも","かえ","ヤストモ","カエ"]);
  userNames.push(["ja","瀬津","孔美","せつ","くみ","セツ","クミ"]);
  userNames.push(["ja","長北","恵巳","ながきた","めぐみ","ナガキタ","メグミ"]);
  userNames.push(["ja","葛見","織枝","くずみ","おりえ","クズミ","オリエ"]);
  userNames.push(["ja","戸簾","恵弥","とみす","えみ","トミス","エミ"]);
  userNames.push(["ja","桑鶴","日奈","くわづる","ひな","クワヅル","ヒナ"]);
  userNames.push(["ja","長利","真梨花","おさり","まりか","オサリ","マリカ"]);
  userNames.push(["ja","由比","加陽子","ゆい","かよこ","ユイ","カヨコ"]);
  userNames.push(["ja","北郷","彩郁","ほくごう","あやか","ホクゴウ","アヤカ"]);
  userNames.push(["ja","長田","久仁香","ちょうだ","くにか","チョウダ","クニカ"]);
  userNames.push(["ja","久川","嵐","くがわ","らん","クガワ","ラン"]);
  userNames.push(["ja","東峰","久美絵","とうみね","くみえ","トウミネ","クミエ"]);
  userNames.push(["ja","皿良","麻利絵","さらら","まりえ","サララ","マリエ"]);
  userNames.push(["ja","袋小路","和美","ふくろこうじ","ふぁみ","フクロコウジ","ファミ"]);
  userNames.push(["ja","向坂","江実","むこうざか","えみ","ムコウザカ","エミ"]);
  userNames.push(["ja","中添","敏美","なかぞえ","さとみ","ナカゾエ","サトミ"]);
  userNames.push(["ja","奥成","ハルナ","おくなり","はるな","オクナリ","ハルナ"]);
  userNames.push(["ja","國部","和海","くにべ","かずみ","クニベ","カズミ"]);
  userNames.push(["ja","下馬場","える","しもばば","える","シモババ","エル"]);
  userNames.push(["ja","髙林","脩子","たかばやし","しゅうこ","タカバヤシ","シュウコ"]);
  userNames.push(["ja","柳渡","実生","やなぎわたり","みき","ヤナギワタリ","ミキ"]);
  userNames.push(["ja","筒口","夕穂","つつぐち","ゆうほ","ツツグチ","ユウホ"]);
  userNames.push(["ja","冨士代","華実","ふじしろ","はなみ","フジシロ","ハナミ"]);
  userNames.push(["ja","国末","暁美","くにすえ","あきみ","クニスエ","アキミ"]);
  userNames.push(["ja","前木場","明加","まえこば","あすか","マエコバ","アスカ"]);
  userNames.push(["ja","百合山","美紗","ゆりやま","みすず","ユリヤマ","ミスズ"]);
  userNames.push(["ja","岡谷","沙也歌","おかのや","さやか","オカノヤ","サヤカ"]);
  userNames.push(["ja","南石","安見","なんせき","やすみ","ナンセキ","ヤスミ"]);
  userNames.push(["ja","藤保","巻","ふじやす","まき","フジヤス","マキ"]);
  userNames.push(["ja","河池","敏","かわいけ","とし","カワイケ","トシ"]);
  userNames.push(["ja","別枝","民","べっし","みん","ベッシ","ミン"]);
  userNames.push(["ja","垣出","えみな","かきで","えみな","カキデ","エミナ"]);
  userNames.push(["ja","革島","佐弥佳","かわしま","さやか","カワシマ","サヤカ"]);
  userNames.push(["ja","能津","裕恵","のうづ","やすえ","ノウヅ","ヤスエ"]);
  userNames.push(["ja","真々田","志延","ままだ","しのぶ","ママダ","シノブ"]);
  userNames.push(["ja","唐牛","松枝","からうし","まつえ","カラウシ","マツエ"]);
  userNames.push(["ja","和歌月","友紀","わかつき","ともき","ワカツキ","トモキ"]);
  userNames.push(["en","黄","轩","","","",""]);
  userNames.push(["en","周","帅","","","",""]);
  userNames.push(["en","徐","文文","","","",""]);
  userNames.push(["en","叶","琛","","","",""]);
  userNames.push(["en","吕","木","","","",""]);
  userNames.push(["en","廖","彩霞","","","",""]);
  userNames.push(["en","莫","茂","","","",""]);
  userNames.push(["en","宋","文慧","","","",""]);
  userNames.push(["en","庞","玉梅","","","",""]);
  userNames.push(["en","黃","承","","","",""]);
  userNames.push(["en","余","诗慧","","","",""]);
  userNames.push(["en","唐","芳婷","","","",""]);
  userNames.push(["en","曹","凤怡","","","",""]);
  userNames.push(["en","洪","环","","","",""]);
  userNames.push(["en","邱","汀","","","",""]);
  userNames.push(["en","田","放","","","",""]);
  userNames.push(["en","石","倩文","","","",""]);
  userNames.push(["en","赖","乐玲","","","",""]);
  userNames.push(["en","傅","云诗","","","",""]);
  userNames.push(["en","爱","秋芝","","","",""]);
  userNames.push(["en","侯","惠莹","","","",""]);
  userNames.push(["en","大","玉静","","","",""]);
  userNames.push(["en","章","素梅","","","",""]);
  userNames.push(["en","倪","云舒","","","",""]);
  userNames.push(["en","嘉","爾","","","",""]);
  userNames.push(["en","詹","大妹","","","",""]);
  userNames.push(["en","付","善洁","","","",""]);
  userNames.push(["en","欧阳","茜世","","","",""]);
  userNames.push(["en","美","古道","","","",""]);
  userNames.push(["en","卓","新颖","","","",""]);
  userNames.push(["en","云","梦娇","","","",""]);
  userNames.push(["en","佩","晓岚","","","",""]);
  userNames.push(["en","志","怒","","","",""]);
  userNames.push(["en","韓","麟","","","",""]);
  userNames.push(["en","祝","江静","","","",""]);
  userNames.push(["en","神","蕊武","","","",""]);
  userNames.push(["en","管","淑真","","","",""]);
  userNames.push(["en","可","咏琪","","","",""]);
  userNames.push(["en","錢","菁成","","","",""]);
  userNames.push(["en","星","蓝天","","","",""]);
  userNames.push(["en","焦","玉芹","","","",""]);
  userNames.push(["en","穆","华华","","","",""]);
  userNames.push(["en","柏","秀金","","","",""]);
  userNames.push(["en","景","妮娅","","","",""]);
  userNames.push(["en","简","伟阔","","","",""]);
  userNames.push(["en","司徒","怡馨","","","",""]);
  userNames.push(["en","项","宙妙","","","",""]);
  userNames.push(["en","小","旭东","","","",""]);
  userNames.push(["en","寂","灵明","","","",""]);
  userNames.push(["en","车","明璐","","","",""]);
  userNames.push(["en","饶","菲娅","","","",""]);
  userNames.push(["en","楚","元群","","","",""]);
  userNames.push(["en","真","依君","","","",""]);
  userNames.push(["en","恩","春英","","","",""]);
  userNames.push(["en","幸福","啸","","","",""]);
  userNames.push(["en","振","钧","","","",""]);
  userNames.push(["en","蔣","洁敏","","","",""]);
  userNames.push(["en","利","游游","","","",""]);
  userNames.push(["en","顺","云嘉","","","",""]);
  userNames.push(["en","巴","燕飞","","","",""]);
  userNames.push(["en","عادل","العادل","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","عادل","العاد ل Jr,","","","",""]);
  userNames.push(["en","Tracy","Allen","","","",""]);
  userNames.push(["en","Yvonne","Moran","","","",""]);
  userNames.push(["en","Colleen","Moody","","","",""]);
  userNames.push(["en","Daisy","Raza","","","",""]);
  userNames.push(["en","Tabitha","Chakraborty","","","",""]);
  userNames.push(["en","Stacie","McDonald,Archer","","","",""]);
  userNames.push(["en","Dian","Lindsay","","","",""]);
  userNames.push(["en","Apple","Benton","","","",""]);
  userNames.push(["en","Pretty,Mei","Chamberlain","","","",""]);
  userNames.push(["en","Irina,Pierce","Ferrell","","","",""]);
  userNames.push(["en","Jo,Ann","Marquez,Mon","","","",""]);
  userNames.push(["en","Sandhya","Lucas,O'Connell","","","",""]);
  userNames.push(["en","Sahar","Richter","","","",""]);
  userNames.push(["en","Chasity","Tahir","","","",""]);
  userNames.push(["en","Shreya","Q,Will","","","",""]);
  userNames.push(["en","Rona","Khurana","","","",""]);
  userNames.push(["en","Deirdre","Huerta","","","",""]);
  userNames.push(["en","Cookie","Jorgensen","","","",""]);
  userNames.push(["en","Payton","Ashton","","","",""]);
  userNames.push(["en","Dayna","Clinton","","","",""]);
  userNames.push(["en","Rosy","Ogden","","","",""]);
  userNames.push(["en","Rosalyn","Gauthier","","","",""]);
  userNames.push(["en","Rhiannon","Abdo","","","",""]);
  userNames.push(["en","Lita","Pettit","","","",""]);
  userNames.push(["en","Meera","Melo","","","",""]);
  userNames.push(["en","Julianna,McKay","O'Hara","","","",""]);
  userNames.push(["en","Leonie","Ernst","","","",""]);
  userNames.push(["en","Christiana","Prieto","","","",""]);
  userNames.push(["en","Farzana","Beam","","","",""]);
  userNames.push(["en","Marielle","Couture","","","",""]);
  userNames.push(["en","Tita","Lunsford","","","",""]);
  userNames.push(["en","Catie,Carolyn","Burnham","","","",""]);
  userNames.push(["en","Lama","Mosher","","","",""]);
  userNames.push(["en","Deidra,Jenny","Dennison","","","",""]);
  userNames.push(["en","Naina","III,Foy","","","",""]);
  userNames.push(["en","Shanta","Amor","","","",""]);
  userNames.push(["en","Yani","Fairchild,III","","","",""]);
  userNames.push(["en","Marybeth","Anggraini","","","",""]);
  userNames.push(["en","Phan","Kurnia","","","",""]);
  userNames.push(["en","Aja","Mokhtar","","","",""]);
  userNames.push(["en","Josette","Brant,Jr.","","","",""]);
  userNames.push(["en","Ro","Overstreet","","","",""]);
  userNames.push(["en","Una","Castañeda","","","",""]);
  userNames.push(["en","Shelbie","Wicks","","","",""]);
  userNames.push(["en","Nadeen","Delfin","","","",""]);
  userNames.push(["en","Ei","Joyner,da,Silva","","","",""]);
  userNames.push(["en","Yoko","Wisdom","","","",""]);
  userNames.push(["en","Husna","Qualls","","","",""]);
  userNames.push(["en","Beulah","Griswold","","","",""]);
  userNames.push(["en","Rahel","Mijares","","","",""]);
  userNames.push(["en","Sofi","Buddy","","","",""]);
  userNames.push(["en","Clarisa","Rahul","","","",""]);
  userNames.push(["en","Cassey","Higdon","","","",""]);
  userNames.push(["en","Yolonda","Than","","","",""]);
  userNames.push(["en","Wina","Lovato","","","",""]);
  userNames.push(["en","Giulia","Manoharan","","","",""]);
  userNames.push(["en","Marilu","Zhong","","","",""]);
  userNames.push(["en","Yna","Brogan","","","",""]);
  userNames.push(["en","Paty","Mido","","","",""]);
  userNames.push(["en","Jiji","Razo","","","",""]);
  
  addresses.push(["910","0828","福井県","福井市","林町","3-1-5","0776-48-5653","1993","2","13"]);
  addresses.push(["254","0026","神奈川県","平塚市","中堂","1-18-6 中堂ステーション416","045-388-0916","1996","9","7"]);
  addresses.push(["780","0902","高知県","高知市","本丁筋","1-15-18","088-969-6537","1997","6","11"]);
  addresses.push(["518","0710","三重県","名張市","上八町","3-11-8 上八町ゴールデン311","059-211-1202","1995","6","11"]);
  addresses.push(["028","8368","岩手県","下閉伊郡普代村","柏木平","2-10-2","019-089-1795","1990","9","10"]);
  addresses.push(["528","0051","滋賀県","甲賀市","水口町北内貴","4-14-8","0749-8-8562","1996","9","25"]);
  addresses.push(["520","0103","滋賀県","大津市","木の岡町","4-6-5 ハウス木の岡町106","0740-28-3810","1964","5","20"]);
  addresses.push(["696","0223","島根県","邑智郡邑南町","下亀谷","2-15-16 下亀谷グリーン318","0853-61-0408","1987","10","23"]);
  addresses.push(["989","0519","宮城県","刈田郡七ヶ宿町","神林山","3-4-15","022-779-5113","1995","2","14"]);
  addresses.push(["779","3405","徳島県","吉野川市","山川町土仏西向","3-10-5 ロイヤルパレス山川町土仏西向210","088-6-0508","1981","2","7"]);
  addresses.push(["811","3208","福岡県","福津市","福間駅東","1-9","0949-90-3612","1997","12","10"]);
  addresses.push(["746","0104","山口県","周南市","米光","3-14 ダイヤモンド米光415","0834-05-9817","1963","9","26"]);
  addresses.push(["408","0117","山梨県","北杜市","須玉町若神子新町","4-2-7","055-569-6889","1991","2","7"]);
  addresses.push(["889","3156","宮崎県","日南市","大窪","2-14-7","0985-62-7269","1989","11","18"]);
  addresses.push(["787","0334","高知県","土佐清水市","加久見入沢町","1-16-17","0889-33-0310","1971","8","6"]);
  addresses.push(["997","1113","山形県","鶴岡市","長崎","2-12-12","023-965-2490","1968","5","8"]);
  addresses.push(["028","6919","岩手県","二戸市","浄法寺町大清水荒屋","2-8-18 タワー浄法寺町大清水荒屋213","0195-78-4212","1985","11","23"]);
  addresses.push(["780","8075","高知県","高知市","朝倉南町","4-3-7","088-012-8601","1961","12","15"]);
  addresses.push(["366","0024","埼玉県","深谷市","明戸","4-15-13","04-9998-2999","1990","2","25"]);
  addresses.push(["999","1502","山形県","西置賜郡小国町","滝倉","4-8 滝倉ダイヤモンド117","023-32-7682","1984","2","7"]);
  addresses.push(["258","0015","神奈川県","足柄上郡大井町","山田","1-1-3","044-584-4658","1976","10","21"]);
  addresses.push(["644","0024","和歌山県","御坊市","塩屋町南塩屋","3-16 塩屋町南塩屋ヴィレッジ318","073-380-9069","1973","3","17"]);
  addresses.push(["343","0031","埼玉県","越谷市","大里","4-9-10","04-3643-4385","1971","2","6"]);
  addresses.push(["851","0132","長崎県","長崎市","鶴の尾町","4-13 ダイヤモンド鶴の尾町308","095-059-6827","1981","1","3"]);
  addresses.push(["384","0025","長野県","小諸市","相生町","4-17-12","026-023-9462","1960","12","21"]);
  addresses.push(["786","0031","高知県","高岡郡四万十町","床鍋","4-9-11 床鍋タウン408","0889-04-3382","1990","3","2"]);
  addresses.push(["954","0176","新潟県","長岡市","横野","4-1-20","0254-90-0620","1990","1","4"]);
  addresses.push(["513","0808","三重県","鈴鹿市","西條町","4-3-16 西條町メゾン115","059-038-1134","1980","11","24"]);
  addresses.push(["840","0503","佐賀県","佐賀市","富士町市川","1-5","0955-25-5566","1974","7","10"]);
  addresses.push(["503","1275","岐阜県","養老郡養老町","大巻","1-5-4","0573-58-8703","1977","5","9"]);
  addresses.push(["410","3214","静岡県","伊豆市","下船原","1-6","054-813-5190","1996","4","8"]);
  addresses.push(["590","0075","大阪府","堺市堺区","南花田口町","3-9","06-2807-6506","1967","5","8"]);
  addresses.push(["378","0313","群馬県","沼田市","利根町日影南郷","2-13-18 レジデンス利根町日影南郷412","027-490-1529","1974","4","13"]);
  addresses.push(["545","0034","大阪府","大阪市阿倍野区","阿倍野元町","1-6","06-2817-9817","1991","11","9"]);
  addresses.push(["501","3134","岐阜県","岐阜市","芥見","1-15-17","0573-14-5013","1966","12","7"]);
  addresses.push(["594","1124","大阪府","和泉市","南面利町","2-8-9 タウン南面利町100","06-4847-9277","1962","2","3"]);
  addresses.push(["710","0814","岡山県","倉敷市","石見町","4-6-3 石見町荘112","0866-12-6336","1981","7","30"]);
  addresses.push(["505","0033","岐阜県","美濃加茂市","中富町","3-5","058-472-1578","1970","12","14"]);
  addresses.push(["959","2705","新潟県","胎内市","鴻ノ巣","2-16-13","025-31-4981","1978","12","7"]);
  addresses.push(["879","5435","大分県","由布市","庄内町中","2-10-5","097-952-3763","1994","7","2"]);
  addresses.push(["900","0006","沖縄県","那覇市","おもろまち","2-9 おもろまちメゾン204","098-567-5782","1959","10","27"]);
  addresses.push(["591","8021","大阪府","堺市北区","新金岡町","1-17 新金岡町ハウス411","075-356-6951","1974","12","2"]);
  addresses.push(["942","0266","新潟県","上越市","三和区越柳","2-1","0259-40-0502","1961","7","5"]);
  addresses.push(["949","1201","新潟県","糸魚川市","越","4-17","025-907-8142","1963","4","6"]);
  addresses.push(["781","2321","高知県","吾川郡いの町","小川東津賀才","1-20-8 ハウス小川東津賀才201","0889-92-5610","1964","5","13"]);
  addresses.push(["699","5523","島根県","鹿足郡吉賀町","朝倉","3-4-7","0853-14-7664","1983","5","21"]);
  addresses.push(["824","0079","福岡県","行橋市","矢山","4-4 プレイス矢山408","093-111-4459","1991","5","13"]);
  addresses.push(["622","0313","京都府","船井郡京丹波町","保井谷","2-4-1","077-897-1927","1998","7","3"]);
  addresses.push(["891","0103","鹿児島県","鹿児島市","皇徳寺台","1-6-11","099-175-1346","1977","9","9"]);
  addresses.push(["927","0563","石川県","鳳珠郡能登町","姫","2-11-8","076-721-9040","1996","5","10"]);
  addresses.push(["847","0111","佐賀県","唐津市","佐志","2-4-10","0954-7-7344","1997","1","26"]);
  addresses.push(["776","0007","徳島県","吉野川市","鴨島町喜来乙","4-12-16 鴨島町喜来乙アパート209","088-733-3463","1993","10","20"]);
  addresses.push(["899","7211","鹿児島県","志布志市","志布志町内之倉","4-7","099-225-8394","1973","4","12"]);
  addresses.push(["779","0108","徳島県","板野郡板野町","犬伏","2-1-6 犬伏荘209","0885-24-0934","1970","4","1"]);
  addresses.push(["918","8212","福井県","福井市","北今泉町","3-2-11","0779-7-7778","1995","6","2"]);
  addresses.push(["319","3365","茨城県","久慈郡大子町","栃原","2-16-13","029-685-4267","1980","8","7"]);
  addresses.push(["019","2614","秋田県","秋田市","河辺豊成","3-6-12","0182-84-3418","1974","3","14"]);
  addresses.push(["289","1615","千葉県","山武郡芝山町","境","1-17-11 境レジデンス100","04-837-6316","1988","5","16"]);
  addresses.push(["289","0111","千葉県","成田市","名木","1-16-12","04-1580-8934","1995","1","10"]);
  addresses.push(["910","0211","福井県","坂井市","丸岡町女形谷","3-2-9 丸岡町女形谷ゴールデン311","0778-11-2341","1964","6","18"]);
  addresses.push(["781","2105","高知県","吾川郡いの町","新町","3-9 新町ヒル419","088-9-7779","1981","10","31"]);
  addresses.push(["490","1144","愛知県","海部郡大治町","西條","4-10-9","0532-58-5441","1969","4","20"]);
  addresses.push(["601","1303","京都府","京都市伏見区","醍醐大畑町","1-20-10 醍醐大畑町スカイ400","0774-28-5600","1985","8","24"]);
  addresses.push(["844","0027","佐賀県","西松浦郡有田町","南原","2-4-9","0954-29-1440","1966","11","23"]);
  addresses.push(["779","4803","徳島県","三好市","井川町中村東","1-9-17","088-610-1216","1992","6","6"]);
  addresses.push(["085","0244","北海道","釧路市","阿寒町紀ノ丘","4-14-16","0137-72-9689","1968","8","19"]);
  addresses.push(["990","1306","山形県","西村山郡朝日町","大暮山","1-8-11","023-279-4385","1959","9","2"]);
  addresses.push(["879","0855","大分県","豊後高田市","田染真木","4-11-17 田染真木プラチナ106","0978-31-3795","1985","7","11"]);
  addresses.push(["614","8159","京都府","八幡市","上奈良大門","3-8-12 上奈良大門テラス310","077-761-1627","1991","12","13"]);
  addresses.push(["036","8016","青森県","弘前市","坂本町","4-15-9 コーポ坂本町211","0173-99-1222","1996","9","29"]);
  addresses.push(["761","4403","香川県","小豆郡小豆島町","当浜","4-8-8","0875-41-1830","1989","8","8"]);
  addresses.push(["708","0702","岡山県","苫田郡鏡野町","富東谷","2-11 グリーン富東谷319","0865-71-0492","1965","9","24"]);
  addresses.push(["970","8036","福島県","いわき市","平谷川瀬","4-7 パレス平谷川瀬108","0244-38-0396","1975","10","29"]);
  addresses.push(["770","0915","徳島県","徳島市","富田町","3-7-9","088-003-0114","1998","4","5"]);
  addresses.push(["261","0025","千葉県","千葉市美浜区","浜田","3-11 タワー浜田410","047-137-6462","1983","11","9"]);
  addresses.push(["379","2231","群馬県","伊勢崎市","東町","4-3-15 東町フォレスト409","027-043-2417","1992","1","20"]);
  addresses.push(["530","0053","大阪府","大阪市北区","末広町","3-9-8","06-6471-1750","1991","9","26"]);
  addresses.push(["528","0049","滋賀県","甲賀市","水口町貴生川","2-14-14","0740-03-0746","1972","5","7"]);
  addresses.push(["771","1703","徳島県","阿波市","阿波町大道北","4-7 フォレスト阿波町大道北414","088-065-5351","1991","2","14"]);
  addresses.push(["027","0086","岩手県","宮古市","新町","1-13-19","019-256-4733","1978","2","27"]);
  addresses.push(["866","0891","熊本県","八代市","古閑浜町","4-12","096-72-9387","1995","11","19"]);
  addresses.push(["890","0012","鹿児島県","鹿児島市","玉里町","2-11 玉里町コート306","099-711-5998","1981","3","27"]);
  addresses.push(["510","0066","三重県","四日市市","南浜田町","4-1-12","0598-31-4536","1979","8","8"]);
  addresses.push(["965","0022","福島県","会津若松市","滝沢町","1-2-14","024-322-5485","1989","4","20"]);
  addresses.push(["981","4222","宮城県","加美郡加美町","下新田","4-15-17 プレシャス下新田408","022-662-0291","1996","2","3"]);
  addresses.push(["108","0073","東京都","港区","三田","1-11-4 リバーサイド三田309","03-8840-9793","1987","2","12"]);
  addresses.push(["969","0264","福島県","西白河郡矢吹町","中畑","2-7 スイート中畑404","0244-41-0201","1995","6","20"]);
  addresses.push(["798","1374","愛媛県","北宇和郡鬼北町","成藤","2-14 ステージ成藤313","0895-20-6308","1982","9","17"]);
  addresses.push(["815","0081","福岡県","福岡市南区","那の川","1-10 ハイツ那の川308","093-209-5180","1977","3","16"]);
  addresses.push(["750","0443","山口県","下関市","豊田町日野","3-16 グリーン豊田町日野408","083-025-4955","1994","10","6"]);
  addresses.push(["943","0606","新潟県","上越市","牧区大月","3-9-9 牧区大月ステーション200","025-4-7230","1986","1","15"]);
  addresses.push(["865","0041","熊本県","玉名市","伊倉北方","2-18-12","0944-98-8934","1975","9","7"]);
  addresses.push(["791","1511","愛媛県","上浮穴郡久万高原町","七鳥","2-18","089-96-7911","1960","9","29"]);
  addresses.push(["989","2478","宮城県","岩沼市","あさひ野","3-2-7","022-193-2537","1964","5","3"]);
  addresses.push(["714","2122","岡山県","井原市","芳井町種","2-7-6","086-160-6491","1962","12","30"]);
  addresses.push(["309","1607","茨城県","笠間市","石寺","1-11-12 石寺コーポ111","0479-80-4638","1976","1","17"]);
  addresses.push(["949","7251","新潟県","南魚沼市","大崎","1-3-9","0256-01-6575","1986","6","20"]);
  addresses.push(["649","6121","和歌山県","紀の川市","桃山町段新田","3-9-15 桃山町段新田コーポ316","073-925-0424","1988","7","30"]);
  addresses.push(["950","0013","新潟県","新潟市東区","白銀","1-15-20","0254-56-7526","1962","12","4"]);
  addresses.push(["763","0044","香川県","丸亀市","福島町","2-18-10 福島町フォレスト104","087-30-7933","1991","1","1"]);
  addresses.push(["640","8146","和歌山県","和歌山市","一番丁","2-5-1","0738-34-0489","1959","9","29"]);
  addresses.push(["760","0078","香川県","高松市","今里町","4-4","0875-06-5828","1960","9","4"]);
  addresses.push(["969","3101","福島県","耶麻郡猪苗代町","新堀田東","1-1-4 新堀田東メゾン413","0240-29-7958","1980","3","7"]);
  addresses.push(["752","0974","山口県","下関市","長府土居の内町","2-11-11","083-293-2986","1978","8","14"]);
  addresses.push(["891","1417","鹿児島県","鹿児島市","桜島赤生原町","4-1","0997-24-8866","1962","11","30"]);
  addresses.push(["989","4507","宮城県","栗原市","瀬峰西原","4-10-12 瀬峰西原テラス410","0220-05-9542","1964","9","15"]);
  addresses.push(["438","0086","静岡県","磐田市","見付","1-17","0537-15-0307","1981","11","28"]);
  addresses.push(["636","0013","奈良県","北葛城郡王寺町","元町","4-2 フォレスト元町308","0742-78-7617","1965","3","7"]);
  addresses.push(["739","2303","広島県","東広島市","福富町久芳","4-9 福富町久芳庵108","084-754-7607","1960","7","14"]);
  addresses.push(["895","2813","鹿児島県","伊佐市","菱刈南浦","4-12","0994-16-6835","1968","7","15"]);
  addresses.push(["889","2151","宮崎県","宮崎市","熊野","2-18-15","0982-11-7751","1995","7","8"]);
  addresses.push(["709","2675","岡山県","加賀郡吉備中央町","福沢","4-17 ステージ福沢400","0867-80-7469","1959","1","30"]);
  addresses.push(["917","0044","福井県","小浜市","飯盛","1-15-6","0770-34-9786","1983","3","15"]);
  addresses.push(["861","4403","熊本県","下益城郡美里町","中郡","1-6-20","096-576-4223","1996","12","16"]);
  addresses.push(["939","1353","富山県","砺波市","十年明","3-1-18 十年明ヒル211","076-625-3700","1997","7","13"]);
  addresses.push(["889","4304","宮崎県","えびの市","上江","1-15-17","0987-74-5862","1983","8","10"]);
  addresses.push(["989","5122","宮城県","栗原市","金成三沢","4-18-3","022-776-1707","1972","10","24"]);
  addresses.push(["851","2124","長崎県","西彼杵郡長与町","丸田郷","2-7-12","095-134-8268","1977","5","21"]);
  addresses.push(["644","0002","和歌山県","御坊市","薗","3-17-6 メゾン薗317","073-906-7368","1991","6","15"]);
  addresses.push(["778","0101","徳島県","三好市","西祖谷山村戸ノ谷","4-10-18","088-38-5053","1998","6","2"]);
  addresses.push(["781","0321","高知県","高知市","春野町秋山","1-2-17","0889-76-8188","1979","2","28"]);
  addresses.push(["729","6212","広島県","三次市","糸井町","4-17-5","0845-66-4590","1961","3","29"]);
  addresses.push(["313","0056","茨城県","常陸太田市","西一町","2-13-9 西一町メゾン109","029-976-8137","1972","8","11"]);
  addresses.push(["527","0107","滋賀県","東近江市","今在家町","2-17-18","0748-34-2767","1965","10","29"]);
  addresses.push(["518","1321","三重県","伊賀市","内保","3-18-10 内保ステージ316","059-890-1314","1988","10","22"]);
  addresses.push(["300","1255","茨城県","つくば市","小茎","4-13-12","029-252-3965","1970","8","3"]);
  addresses.push(["847","0034","佐賀県","唐津市","中原","4-20-4","0942-07-9198","1985","6","18"]);
  addresses.push(["377","1309","群馬県","吾妻郡長野原町","林","3-17","027-539-7185","1980","10","12"]);
  addresses.push(["002","8073","北海道","札幌市北区","あいの里三条","1-12-8","0142-67-5958","1967","2","24"]);
  addresses.push(["235","0015","神奈川県","横浜市磯子区","久木町","2-18-17","044-431-1646","1980","12","31"]);
  addresses.push(["018","3312","秋田県","北秋田市","花園町","3-7-9","0185-41-4448","1982","3","23"]);
  addresses.push(["136","0074","東京都","江東区","東砂","1-7-9","03-8620-6833","1960","5","9"]);
  addresses.push(["360","0844","埼玉県","熊谷市","御稜威ケ原","4-6-10","04-5927-4669","1965","12","1"]);
  addresses.push(["885","0018","宮崎県","都城市","郡元","2-12 郡元荘317","0982-93-6394","1972","8","27"]);
  addresses.push(["690","2105","島根県","松江市","八雲町平原","4-17","0856-67-8795","1963","7","21"]);
  addresses.push(["940","1102","新潟県","長岡市","東宮内町","3-10","0254-09-8372","1963","9","8"]);
  addresses.push(["277","0831","千葉県","柏市","根戸","3-4 根戸フォレスト110","04-8849-6151","1970","3","27"]);
  addresses.push(["088","1147","北海道","厚岸郡厚岸町","太田７の通り","4-5-14 太田７の通りの杜114","0124-60-0271","1976","8","11"]);
  addresses.push(["891","3704","鹿児島県","熊毛郡南種子町","中之下","4-10","0994-45-8157","1974","1","17"]);
  addresses.push(["685","0003","島根県","隠岐郡隠岐の島町","犬来","4-11-6 ザ犬来403","0856-78-8625","1980","4","18"]);
  addresses.push(["891","9111","鹿児島県","大島郡和泊町","手々知名","4-13-20","099-372-1055","1985","2","15"]);
  addresses.push(["315","0161","茨城県","石岡市","小塙","3-10 ザ小塙104","029-308-1691","1980","3","8"]);
  addresses.push(["920","0012","石川県","金沢市","磯部町","2-9-12","076-752-2592","1974","11","11"]);
  addresses.push(["247","0053","神奈川県","鎌倉市","今泉台","4-1-13 今泉台ダイヤモンド307","046-088-6516","1971","12","13"]);
  addresses.push(["307","0021","茨城県","結城市","上山川","3-10-2 ロイヤルパレス上山川407","0297-12-5460","1976","1","14"]);
  addresses.push(["520","1143","滋賀県","高島市","黒谷","1-4-7","0740-20-2689","1961","2","5"]);
  addresses.push(["257","0025","神奈川県","秦野市","落合","2-16-4","046-911-7941","1976","7","11"]);
  addresses.push(["313","0021","茨城県","常陸太田市","大森町","1-18-20 大森町タウン307","029-74-7325","1984","12","24"]);
  addresses.push(["753","0823","山口県","山口市","若宮町","4-8-17","0838-81-4700","1969","10","27"]);
  addresses.push(["746","0012","山口県","周南市","政所","4-8-2","0835-41-6199","1988","7","17"]);
  addresses.push(["850","0853","長崎県","長崎市","浜町","2-8","0956-76-7844","1973","9","17"]);
  addresses.push(["959","3422","新潟県","村上市","飯岡","3-1-15","025-709-1758","1987","4","3"]);
  addresses.push(["933","0207","富山県","射水市","白石","2-12-14 リバーサイド白石407","076-262-6286","1962","1","13"]);
  addresses.push(["640","8221","和歌山県","和歌山市","湊紺屋町","3-13 湊紺屋町荘112","073-139-5736","1981","12","3"]);
  addresses.push(["919","1204","福井県","三方郡美浜町","北田","2-20-20 北田ハイツ402","0778-6-7556","1973","8","12"]);
  addresses.push(["604","8001","京都府","京都市中京区","上大阪町","3-18-5","0771-1-7655","1970","2","16"]);
  addresses.push(["501","4502","岐阜県","郡上市","和良町宮代","1-15-19","058-95-1325","1968","11","25"]);
  addresses.push(["861","4222","熊本県","熊本市南区","城南町鰐瀬","3-9-20","096-727-8900","1963","10","31"]);
  addresses.push(["764","0018","香川県","仲多度郡多度津町","東港町","4-20-19","087-791-2303","1997","10","4"]);
  addresses.push(["760","0074","香川県","高松市","桜町","3-20-13 フォレスト桜町301","0877-32-0014","1963","9","3"]);
  addresses.push(["870","0944","大分県","大分市","米良","1-6-10 米良ダイヤモンド313","097-532-4707","1967","6","8"]);
  addresses.push(["015","0883","秋田県","由利本荘市","下地ケ沢","2-5-1 下地ケ沢プラザ111","0185-10-9320","1971","2","4"]);
  addresses.push(["038","0012","青森県","青森市","柳川","2-12-15 パレス柳川317","017-666-2581","1979","8","29"]);
  addresses.push(["440","0843","愛知県","豊橋市","東幸町","4-10-14","0531-04-9005","1969","8","29"]);
  addresses.push(["949","2218","新潟県","妙高市","花房","1-2-19","0250-14-5918","1998","1","12"]);
  addresses.push(["889","4233","宮崎県","えびの市","灰塚","2-9","0985-04-9150","1977","3","16"]);
  addresses.push(["515","0822","三重県","松阪市","大足町","3-9-13","059-181-1529","1989","12","7"]);
  addresses.push(["241","0013","神奈川県","横浜市旭区","三反田町","1-20","044-990-8628","1986","7","3"]);
  addresses.push(["400","0804","山梨県","甲府市","酒折町","4-9-11 酒折町庵101","0554-66-4135","1963","1","18"]);
  addresses.push(["899","6506","鹿児島県","霧島市","牧園町下中津川","4-7-13","0996-48-2368","1984","11","14"]);
  addresses.push(["874","0912","大分県","別府市","南須賀","1-20-3 南須賀アパート405","097-911-1717","1995","7","19"]);
  addresses.push(["755","0057","山口県","宇部市","藤曲","1-9 藤曲ランド313","083-147-8239","1962","11","27"]);
  addresses.push(["769","2701","香川県","東かがわ市","湊","4-17-13","0877-43-2400","1982","4","28"]);
  addresses.push(["991","0035","山形県","寒河江市","幸町","1-18-14 リバーサイド幸町403","023-186-2980","1993","9","22"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","古川町","1-1-1 ドリーム古川町414","0748-25-0307","1980","4","11"]);
  addresses.push(["252","0011","神奈川県","座間市","相武台","4-20-13","045-287-5266","1994","3","5"]);
  addresses.push(["529","1635","滋賀県","蒲生郡日野町","迫","4-1","0740-6-7738","1975","4","29"]);
  addresses.push(["298","0131","千葉県","いすみ市","荻原","2-13-14 荻原ドリーム404","043-895-9473","1983","2","22"]);
  addresses.push(["321","0906","栃木県","宇都宮市","中久保","3-12-17","0288-96-2128","1982","3","9"]);
  addresses.push(["950","0965","新潟県","新潟市中央区","新光町","2-15-17 ザ新光町403","0258-74-2992","1976","9","2"]);
  addresses.push(["882","0032","宮崎県","延岡市","中の瀬町","4-11","0982-37-8605","1980","8","19"]);
  addresses.push(["869","5451","熊本県","葦北郡芦北町","道川内","3-6-14 ステーション道川内203","096-764-0248","1979","1","18"]);
  addresses.push(["013","0037","秋田県","横手市","前郷二番町","2-7-8 前郷二番町荘205","018-532-0689","1961","4","30"]);
  addresses.push(["037","0062","青森県","五所川原市","旭町","4-14","017-659-1788","1994","5","30"]);
  addresses.push(["682","0902","鳥取県","倉吉市","上神","2-12 ヴィレッジ上神419","0859-7-9016","1987","3","28"]);
  addresses.push(["256","0814","神奈川県","小田原市","川匂","3-3-14","045-268-0871","1990","5","23"]);
  addresses.push(["959","2331","新潟県","新発田市","下飯塚","2-10-1 下飯塚アパート415","0254-06-8790","1976","7","7"]);
  addresses.push(["316","0036","茨城県","日立市","鮎川町","3-5","029-182-2294","1965","5","3"]);
  addresses.push(["981","0903","宮城県","仙台市青葉区","台原森林公園","4-5-2","022-127-8137","1984","2","8"]);
  addresses.push(["888","0222","宮崎県","串間市","都井","3-1 都井庵207","0982-57-7784","1987","5","8"]);
  addresses.push(["901","2403","沖縄県","中頭郡中城村","伊舎堂","2-5-19","098-603-1550","1982","10","21"]);
  addresses.push(["523","0056","滋賀県","近江八幡市",",","-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  addresses.push(["523","0056","滋賀県","近江八幡市","<script>alert('test')</script>","/**-","0748-25-0307","1980","4","11"]);
  

  prefCodes['北海道'] = '1';
  prefCodes['青森県'] = '2';
  prefCodes['岩手県'] = '3';
  prefCodes['宮城県'] = '4';
  prefCodes['秋田県'] = '5';
  prefCodes['山形県'] = '6';
  prefCodes['福島県'] = '7';
  prefCodes['茨城県'] = '8';
  prefCodes['栃木県'] = '9';
  prefCodes['群馬県'] = '10';
  prefCodes['埼玉県'] = '11';
  prefCodes['千葉県'] = '12';
  prefCodes['東京都'] = '13';
  prefCodes['神奈川県'] = '14';
  prefCodes['新潟県'] = '15';
  prefCodes['富山県'] = '16';
  prefCodes['石川県'] = '17';
  prefCodes['福井県'] = '18';
  prefCodes['山梨県'] = '19';
  prefCodes['長野県'] = '20';
  prefCodes['岐阜県'] = '21';
  prefCodes['静岡県'] = '22';
  prefCodes['愛知県'] = '23';
  prefCodes['三重県'] = '24';
  prefCodes['滋賀県'] = '25';
  prefCodes['京都府'] = '26';
  prefCodes['大阪府'] = '27';
  prefCodes['兵庫県'] = '28';
  prefCodes['奈良県'] = '29';
  prefCodes['和歌山県'] = '30';
  prefCodes['鳥取県'] = '31';
  prefCodes['島根県'] = '32';
  prefCodes['岡山県'] = '33';
  prefCodes['広島県'] = '34';
  prefCodes['山口県'] = '35';
  prefCodes['徳島県'] = '36';
  prefCodes['香川県'] = '37';
  prefCodes['愛媛県'] = '38';
  prefCodes['高知県'] = '39';
  prefCodes['福岡県'] = '40';
  prefCodes['佐賀県'] = '41';
  prefCodes['長崎県'] = '42';
  prefCodes['熊本県'] = '43';
  prefCodes['大分県'] = '44';
  prefCodes['宮崎県'] = '45';
  prefCodes['鹿児島県'] = '46';
  prefCodes['沖縄県'] = '47';
}